app/Http/Controllers/Role/RoleManagementController.php

select * from `roles` where `name` != 'super admin'
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (1, 2, 3, 4)
---
    public function index()
    {
        $roles = Role::with('permissions')->where('name', '!=', 'super admin')->get();

select * from `roles`
---
    public function storeRole(Request $request)
    {
        $role = str()->lower($request->role);
        Role::create([
            'name' => $role,
        ]);
        return back()->with('success', 'Role Added');

select * from `roles` where `roles`.`id` = '4' limit 1
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (4)
select * from `permissions`
---
    public function editRole($id)
    {
        $role = Role::with('permissions')->find($id);
        $permissions = Permission::toBase()->get();

select * from `roles` where `roles`.`id` = '4' limit 1
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (4)
---
    public function updateRole(Request $request, $id)
    {
        // dd($request->all());
        $role = Role::with('permissions')->find($id);