app/Http/Livewire/Seminars/Seminar.php

    public function render()
    {
        return view('livewire.seminars.seminar', ['seminars' => ModelsSeminar::with('leeds')->orderBy('date', 'ASC')->select('id', 'name', 'date', 'status')->paginate(5)]);
---
select `id`, `name`, `date`, `status` from `seminars` order by `date` asc limit 5 offset 0
select count(*) as aggregate from `seminars`

    public function changeStatus($seminar_Id)
    {
        $seminar = ModelsSeminar::find($seminar_Id);
        if ($seminar->status == false) {
            $seminar->status = true;
        } else {
            $seminar->status = false;
        }
        $seminar->save();
---
select * from `seminars` where `seminars`.`id` = 1 limit 1
update `seminars` set `status` = 0, `seminars`.`updated_at` = '2022-05-20 11:53:16' where `id` = 1

    public function confirmDelete($seminarId)
    {
        ModelsSeminar::find($seminarId)->delete();
---
delete from `seminars` where `id` = 7
select * from `seminars` where `seminars`.`id` = 7 limit 1