app/Http/Livewire/Blog/ApproveBlog.php

    public function render()
    {
        return view('livewire.blog.approve-blog', ['blogs' => BlogPost::where('title', 'LIKE', '%' . $this->search . '%')->where('status', false)->latest()->get()]);
---
select * from `blog_posts` where `title` LIKE '%%' and `status` = 0 order by `created_at` desc