app/Http/Livewire/Blog/BlogCreate.php

select * from `blog_categories`
---
    public function render()
    {
        return view('livewire.blog.blog-create', ['categories' => BlogCategory::toBase()->get()]);