app/Http/Livewire/Blog/BlogCreate.php

    public function mount()
    {
        if ($this->blogId) {
            $blog = BlogPost::with('categories')->find($this->blogId);;
---
select * from `blog_posts` where `blog_posts`.`id` = '1' limit 1
select `blog_categories`.*, `blog_category_blog_post`.`blog_post_id` as `pivot_blog_post_id`, `blog_category_blog_post`.`blog_category_id` as `pivot_blog_category_id` from `blog_categories` inner join `blog_category_blog_post` on `blog_categories`.`id` = `blog_category_blog_post`.`blog_category_id` where `blog_category_blog_post`.`blog_post_id` in (1)

    public function render()
    {
        return view('livewire.blog.blog-create', ['categories' => BlogCategory::toBase()->get()]);
---
select * from `blog_categories`

    public function saveBlog()
    {
        $this->validate([
            'title' => 'required',
            'detail' => 'required',
            'thumbnail' => 'required',
            'featureImg' => 'required',
        ]);
        $slug = str()->slug($this->title);
        if (BlogPost::where('slug', $slug)->exists()) {
            $slug = str()->slug($this->title) . uniqid();
        }
        if ($this->blogId) {
            $blog =  BlogPost::find($this->blogId);
---
select exists(select * from `blog_posts` where `slug` = 'is-web-design-graphics-design-same') as `exists`
select * from `blog_posts` where `blog_posts`.`id` = '1' limit 1