app/Http/Livewire/Blog/Category.php

select * from `blog_categories` order by `created_at` desc
---
    public function render()
    {
        return view('livewire.blog.category', ['departments' => BlogCategory::latest()->toBase()->get()]);