app/Http/Livewire/Customize/FacebookReview.php

    public function saveReview()
    {
        $this->validate([
            'iframe' => 'required'
        ]);
        FbReview::create([
            'iframe' => $this->iframe,
        ]);
---
insert into `fb_reviews` (`iframe`, `updated_at`, `created_at`) values ('<iframe src=\"https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fyasinashraf.yasinashraf.378%2Fposts%2F1232526093942539&show_text=true&width=500\" width=\"500\" height=\"188\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowfullscreen=\"true\" allow=\"autoplay; clipboard-write; encrypted-media; picture-in-picture; web-share\"></iframe>', '2022-06-01 15:07:35', '2022-06-01 15:07:35')