app/Http/Livewire/Customize/HomeCustomize.php

    public function mount()
    {
        $home = ModelHomeCustomize::first();
---
select * from `home_customizes` limit 1

    public function render()
    {
        return view('livewire.customize.home-customize', ['reviews' => FbReview::toBase()->get()]);
---
select * from `fb_reviews`