app/Http/Livewire/Customize/PromoModal.php

select * from `customizes` limit 1
---
    public function mount()
    {
        $customize = Customize::first();

select * from `customizes` limit 1
update `customizes` set `modal_img` = '/storage/photos/yTix2.jpg', `customizes`.`updated_at` = '2022-05-28 13:52:44' where `id` = 1
---
    public function setModalImg($link)
    {
        $this->modalImg = $link['link'];
        $customize = Customize::first();
        $customize->modal_img = $this->modalImg;
        $customize->save();