app/Http/Livewire/Customize/SocialIcon.php

select * from `social_icons`
---
    public function success()
    {
        session()->flash('message', 'New Social Link has been Added');
        $this->socialIcons = SocialIcons::get()->toArray();