app/Http/Livewire/Story/SuccessForm.php

    public function saveStory()
    {
        $iframeLink = $this->iframe;
        $iframeImg = str()->between($iframeLink,  'embed/', '?autoplay=1');
        if ($this->storyId) {
            $success =  SuccessStory::find($this->storyId);
        } else {
            $success = new SuccessStory();
        }
        $success->iframe = $iframeLink;
        $success->iframe_img = $iframeImg;
        $success->save();
---
insert into `success_stories` (`iframe`, `iframe_img`, `updated_at`, `created_at`) values ('https://www.youtube.com/embed/PflcC-Zz1II', 'PflcC-Zz1II', '2022-05-24 16:38:53', '2022-05-24 16:38:53')