app/Http/Livewire/Story/SuccessStory.php

select * from `success_descriptions` limit 1
---
    public function  mount()
    {
        $description = SuccessDescription::toBase()->first();

select * from `success_stories` order by `created_at` desc limit 7 offset 0
---
    public function render()
    {
        return view('livewire.story.success-story', ['stories' => ModelsSuccessStory::latest()->toBase()->simplePaginate(6)]);