app/Http/Livewire/Contact/Contacts.php

select * from `contacts` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `contacts`
---
    public function searchable()
    {

        $query =  Contact::query();
        if ($this->search) {
            $query->where('name', 'LIKE', '%' . $this->search . '%')->orWhere('email', 'LIKE', '%' . $this->search . '%')->orWhere('phone', 'LIKE', '%' . $this->search . '%');
        }
        if ($this->fromDate && !$this->toDate) {
            $query->whereBetween('created_at', [$this->fromDate, Carbon::now()]);
        } elseif (!$this->fromDate && $this->toDate) {

            $query->whereBetween('created_at', ['1900-01-01', Carbon::parse($this->toDate)->addDay()]);
        } elseif ($this->fromDate && $this->toDate) {

            $query->whereBetween('created_at', [Carbon::parse($this->fromDate), Carbon::parse($this->toDate)->addDay()]);
        }
        return $query->latest()->paginate(20);