app/Http/Livewire/About/AboutEdit.php

select * from `abouts` limit 1
---
    public function mount()
    {
        $aboutData = About::first();