app/Http/Livewire/BannerEditForm.php

    public function mount()
    {
        $item = Banner::find($this->banner_id);
---
select * from `banners` where `banners`.`id` = 2 and `banners`.`deleted_at` is null limit 1

    public function render()
    {
        return view('livewire.banner-edit-form', ['banner' => Banner::find($this->banner_id), 'files' => FileManager::latest()->toBase()->get()]);
---
select * from `banners` where `banners`.`id` = 2 and `banners`.`deleted_at` is null limit 1