app/Http/Livewire/BannerTrash.php

select * from `banners` where `banners`.`deleted_at` is not null order by `created_at` desc limit 16 offset 0
---
    public function render()
    {
        return view('livewire.banner-trash', ['banners' => Banner::onlyTrashed()->latest()->toBase()->simplePaginate()]);