app/Http/Livewire/DepartmentEdit.php

select `id`, `name` from `departments` where `departments`.`id` = 1 and `departments`.`deleted_at` is null limit 1
---
    public function mount()
    {
        $department = Department::find($this->dp_id, ['id', 'name']);