app/Http/Livewire/FileUploadForm.php

    public function save()
    {
        $this->validate(
            [
                'files.*' => 'mimes:jpg,jpeg,webp,png', // 1MB Max
            ],
            [
                'files.*.mimes' => 'Support File Type jpg,jpeg,webp,png'
            ]
        );
        foreach ($this->files as $file) {

            $imageName = Str::random(5) . '.' . $file->extension();

            $fileManager = new FileManager();
            $fileManager->name = $imageName;
            $fileManager->link = env('APP_URL') . '/storage/photos/' . $imageName;
            $fileManager->save();
---
insert into `file_managers` (`name`, `link`, `updated_at`, `created_at`) values ('L0BWl.webp', 'http://127.0.0.1:8000/storage/photos/L0BWl.webp', '2022-05-25 14:09:52', '2022-05-25 14:09:52')