app/Http/Livewire/Portfolio.php

select * from `portfolios` limit 1
---
    public function updatePortfolio()
    {
        $portfolio = ModelsPortfolio::first();