app/Http/Controllers/Frontend/FrontendController.php

    public function index()
    {
        // banner
        $homeCustomize = HomeCustomize::first();
        if ($homeCustomize->banner_stle == 'ctg') {
            $banners = Banner::where('status', true)->toBase()->get();
        } else {
            $banners = BannerPart::first();
        }
        // banner end
        // department
        $departments = Department::where('status', true)->get();
        // department end
        // course
        $courses = Course::with(['department' => function ($query) {
            $query->select('id', 'name', 'status')->where('status', true);
        }])->select('id', 'department_id', 'title', 'slug', 'detail', 'thumbnail', 'status')->where('status', true)->get();
        // course end

        // SEMINAR
        $seminars = Seminar::orderBy('date', 'ASC')->where('status', true)->get();
        // SEMINAR

        // facilities
        $facilities = Cache::rememberForever('facilityCache', function () {
            return Facilities::limit(9)->select('id', 'image', 'title', 'detail')->toBase()->get();
        });
        // customizer options
        $customize = Customize::toBase()->first(['promo_modal', 'modal_img', 'preloader']);
---
select * from `home_customizes` limit 1
select * from `banners` where `status` = 1 and `banners`.`deleted_at` is null
select * from `departments` where `status` = 1 and `departments`.`deleted_at` is null
select `id`, `department_id`, `title`, `slug`, `detail`, `thumbnail`, `status` from `courses` where `status` = 1 and `courses`.`deleted_at` is null
select `id`, `name`, `status` from `departments` where `departments`.`id` in (1) and `status` = 1 and `departments`.`deleted_at` is null
select * from `seminars` where `status` = 1 order by `date` asc
select `id`, `image`, `title`, `detail` from `facilities` limit 9
select `promo_modal`, `modal_img`, `preloader` from `customizes` limit 1

    public function successStory()
    {
        $successStories = SuccessStory::toBase()->latest()->get();
---
select * from `success_stories`

    public function courseView($slug)
    {
        $course = Course::with(['features' => function ($q) {
            $q->where('status', true);
        }])->where('slug', $slug)->where('status', true)->first();
---
select * from `courses` where `slug` = 'professional-graphic-design' and `status` = 1 and `courses`.`deleted_at` is null limit 1

    public function faculties()
    {
        $faculties = Faculties::with(['department' => function ($q) {
            $q->select('name', 'status')->where('status', true);
        }])->select('id', 'img', 'name', 'designation', 'speciality', 'education', 'status', 'marketplace')->where('status', true)->paginate(20);
---
select `id`, `img`, `name`, `designation`, `speciality`, `education`, `status`, `marketplace` from `faculties` where `status` = 1 limit 20 offset 0
select count(*) as aggregate from `faculties` where `status` = 1
select `id`, `name` from `departments` where `status` = 1 and `departments`.`deleted_at` is null