app/Http/Controllers/Frontend/FrontendController.php

select `id`, `title`, `duration`, `thumbnail`, `total_class`, `status`, `department_id`, `slug` from `courses` where `courses`.`department_id` in (1, 2, 3, 4) and `status` = 1 and `courses`.`deleted_at` is null
---
    public function index()
    {
        // banner
        $homeCustomize = HomeCustomize::first();
        if ($homeCustomize->banner_stle == 'ctg') {
            $banners = Cache::rememberForever('bannerCache', function () {
                return Banner::where('status', true)->toBase()->get();
            });
        } else {
            $banners = Cache::rememberForever('bannerPartCache', function () {
                return BannerPart::first();
            });
        }
        // banner end
        // department
        if ($homeCustomize->course_stle == 'ctg') {
            $departments = Department::where('status', true)->get();
        } else if ($homeCustomize->course_stle == 'dhaka') {
            $departments = Department::with(['Courses' => function ($q) {
                $q->where('status', true)->select('id', 'title', 'duration', 'thumbnail', 'total_class', 'status', 'department_id', 'slug');
            }])->where('status', true)->get();

select * from `seminars` where `status` = 1 order by `date` asc
---
        // course end

        // SEMINAR
        $seminars = Seminar::orderBy('date', 'ASC')->where('status', true)->get();

select `promo_modal`, `modal_img`, `preloader` from `customizes` limit 1
---
            return Facilities::limit(9)->select('id', 'image', 'title', 'detail')->toBase()->get();
        });
        // customizer options
        $customize = Customize::toBase()->first(['promo_modal', 'modal_img', 'preloader']);

select * from `home_customizes` limit 1
select * from `courses` where `slug` = 'professional-graphics-design' and `status` = 1 and `courses`.`deleted_at` is null limit 1
select * from `features` where `features`.`course_id` in (1) and `status` = 1
select * from `courses` where `department_id` = 2 and `status` = 1 and `slug` != 'professional-graphics-design' and `courses`.`deleted_at` is null limit 3
select * from `features` where `features`.`course_id` in (2) and `status` = 1
---
    public function courseView($slug)
    {
        $homeCustomize = HomeCustomize::first();

        $course = Course::with(['features' => function ($q) {
            $q->where('status', true);
        }])->where('slug', $slug)->where('status', true)->first();

        $relatedCourses = Course::where('department_id', $course->department_id)->with(['features' => function ($q) {
            $q->where('status', true);
        }])->where('status', true)->where('slug', '!=', $slug)->limit(3)->get();

select count(*) as aggregate from `faculties` where `status` = 1
select `id`, `name` from `departments` where `status` = 1 and `departments`.`deleted_at` is null
---
    public function faculties()
    {
        $faculties = Faculties::with(['department' => function ($q) {
            $q->select('name', 'status')->where('status', true);
        }])->select('id', 'img', 'name', 'designation', 'speciality', 'education', 'status', 'marketplace')->where('status', true)->paginate(20);
        $departments = Department::select('id', 'name')->where('status', true)->toBase()->get();