app/Http/Controllers/Frontend/FrontendController.php

select * from `seminars` order by `date` asc
---
    public function index()
    {
        // banner
        $banners = Banner::where('status', true)->toBase()->get();
        // banner end
        // department
        $departments = Department::where('status', true)->get();
        // department end
        // course
        $courses = Course::with(['department' => function ($query) {
            $query->select('id', 'name');
        }])->select('id', 'department_id', 'title', 'slug', 'detail', 'thumbnail', 'status')->where('status', true)->get();
        // course end
        // SEMINAR
        $seminars = Seminar::orderBy('date', 'ASC')->get();