app/Http/Controllers/BlogController.php

select * from `blog_posts` where `status` = 1 limit 10 offset 0
select count(*) as aggregate from `blog_posts` where `status` = 1
---
    public function blogIndex()
    {
        $trendBlog = BlogPost::with('categories')->where('status', true)->where('trending', true)->limit(5)->get();
        $blogs = BlogPost::with('categories')->where('status', true)->paginate(10);

select `title`, `title`, `detail`, `status`, `created_at`, `img` from `blog_posts` where `status` = 1 and `slug` = 'this-is-graphics-design-blog' limit 1
select `blog_categories`.*, `blog_category_blog_post`.`blog_post_id` as `pivot_blog_post_id`, `blog_category_blog_post`.`blog_category_id` as `pivot_blog_category_id` from `blog_categories` inner join `blog_category_blog_post` on `blog_categories`.`id` = `blog_category_blog_post`.`blog_category_id` where `blog_category_blog_post`.`blog_post_id` in (3)
---
    public function blogView($category, $slug)
    {
        $relatedBLog = BlogPost::with('categories')->whereHas('categories', function ($q) use ($category) {
            $q->where('name', $category);
        })->latest()->select('id', 'title', 'thumbnail', 'slug')->where('status', true)->limit(3)->get();
        $blog = BlogPost::with('categories')->where('status', true)->where('slug', $slug)->select('title', 'title', 'detail', 'status', 'created_at', 'img')->first();

select `id`, `thumbnail`, `title`, `short_detail`, `status` from `blog_posts` where `status` = 1
---
    public function blogEdit()
    {
        $blogs = BlogPost::with('categories')->select('id', 'thumbnail', 'title', 'short_detail', 'status')->where('status', true)->get();