app/Http/Controllers/BlogController.php

    public function blogIndex()
    {
        $trendBlog = BlogPost::with('categories')->where('status', true)->where('trending', true)->limit(5)->get();
        $blogs = BlogPost::with('categories')->where('status', true)->latest()->limit(6)->get();
        $categoryWiseBlog = BlogCategory::with(['posts' => function ($q) {
            $q->latest()->limit(6);
        }])->where('status', true)->limit(5)->latest()->get();
---
select * from `blog_posts` where `status` = 1 and `trending` = 1 limit 5
select `blog_categories`.*, `blog_category_blog_post`.`blog_post_id` as `pivot_blog_post_id`, `blog_category_blog_post`.`blog_category_id` as `pivot_blog_category_id` from `blog_categories` inner join `blog_category_blog_post` on `blog_categories`.`id` = `blog_category_blog_post`.`blog_category_id` where `blog_category_blog_post`.`blog_post_id` in (1, 2)
select * from `blog_posts` where `status` = 1 order by `created_at` desc limit 6
select `blog_categories`.*, `blog_category_blog_post`.`blog_post_id` as `pivot_blog_post_id`, `blog_category_blog_post`.`blog_category_id` as `pivot_blog_category_id` from `blog_categories` inner join `blog_category_blog_post` on `blog_categories`.`id` = `blog_category_blog_post`.`blog_category_id` where `blog_category_blog_post`.`blog_post_id` in (1, 2, 3)
select * from `blog_categories` where `status` = 1 order by `created_at` desc limit 5
select `blog_posts`.*, `blog_category_blog_post`.`blog_category_id` as `pivot_blog_category_id`, `blog_category_blog_post`.`blog_post_id` as `pivot_blog_post_id` from `blog_posts` inner join `blog_category_blog_post` on `blog_posts`.`id` = `blog_category_blog_post`.`blog_post_id` where `blog_category_blog_post`.`blog_category_id` in (1, 2) order by `created_at` desc, `created_at` desc limit 6

    public function categoryView($slug)
    {

        $blogs = [];
        $trendBlog = [];
        $categoryWiseBlog = BlogCategory::with(['posts' => function ($q) {
            $q->latest();
        }])->where('status', true)->where('name', $slug)->latest()->get();
---
select * from `blog_categories` where `status` = 1 and `name` = 'web' order by `created_at` desc
select `blog_posts`.*, `blog_category_blog_post`.`blog_category_id` as `pivot_blog_category_id`, `blog_category_blog_post`.`blog_post_id` as `pivot_blog_post_id` from `blog_posts` inner join `blog_category_blog_post` on `blog_posts`.`id` = `blog_category_blog_post`.`blog_post_id` where `blog_category_blog_post`.`blog_category_id` in (1) order by `created_at` desc, `created_at` desc

    public function searchView(Request $request)
    {

        $blogs = BlogPost::where('status', true)->where('title', 'LIKE', '%' . $request->search . '%')
            ->paginate(15);
---
select * from `blog_posts` where `status` = 1 and `title` LIKE '%%' limit 15 offset 0
select count(*) as aggregate from `blog_posts` where `status` = 1 and `title` LIKE '%%'

    public function blogView($category, $slug)
    {
        $relatedBLog = BlogPost::with('categories')->whereHas('categories', function ($q) use ($category) {
            $q->where('name', $category);
        })->latest()->select('id', 'title', 'thumbnail', 'slug')->where('slug', '!=', $slug)->where('status', true)->limit(3)->get();
        $blog = BlogPost::with('categories')->where('status', true)->where('slug', $slug)->select('title', 'title', 'detail', 'status', 'created_at', 'img')->first();
---
select `blog_categories`.*, `blog_category_blog_post`.`blog_post_id` as `pivot_blog_post_id`, `blog_category_blog_post`.`blog_category_id` as `pivot_blog_category_id` from `blog_categories` inner join `blog_category_blog_post` on `blog_categories`.`id` = `blog_category_blog_post`.`blog_category_id` where `blog_category_blog_post`.`blog_post_id` in (0)
select `title`, `title`, `detail`, `status`, `created_at`, `img` from `blog_posts` where `status` = 1 and `slug` = 'this-is-graphics-design-blog' limit 1