app/Http/Controllers/DiscountCourseController.php

    function confirmOTP(Request $request)
    {

        $request->validate([
            'otp' => 'required',

        ]);
        if (session('OTP')) {
            if (session('OTP') == $request->otp) {
                LuckyWheel::updateOrCreate(['phone' => $request->phone], [
                    'name' => $request->name,
                    'phone' => $request->phone
                ]);
---
select * from `lucky_wheels` where (`phone` = '01997492233') limit 1
insert into `lucky_wheels` (`name`, `phone`, `updated_at`, `created_at`) values ('shourab', '01997492233', '2022-06-30 13:38:36', '2022-06-30 13:38:36')

    function successSpin(Request $request)
    {
        if (Session::has('OTP')) {
            $wheel =  LuckyWheel::where('phone', $request->get('session_value'))->first();
            $wheel->discount = $request->final_text;
            $wheel->save();
---
select * from `lucky_wheels` where `phone` = '01997492233' limit 1
update `lucky_wheels` set `discount` = '35%', `lucky_wheels`.`updated_at` = '2022-06-30 16:08:40' where `id` = 43