app/Http/Livewire/Dashboard/DashboardComponent.php

    public function mount()
    {

        // dd(Role::with('permissions')->where('name', 'user')->first());
        $seminar = Seminar::select('id', 'name', 'status', 'date')->where('status', true)->withCount(['leeds' => function ($q) {
            $q->whereMonth('created_at', Carbon::now()->month);
        }])->whereMonth('date', Carbon::now()->month)->get();

        $this->seminarList = $seminar;

        // TODAYS SEMINAR'S LEEDS
        $currentSeminar  = Seminar::with('leeds')->whereBetween('date', [Carbon::now()->startOfWeek(), Carbon::now()->endOfWeek()])->where('status', true)->orderBy('date', 'ASC')->get();
        // dd($currentSeminar);
        if ($currentSeminar != null) {
            $this->seminars = $currentSeminar;
        }

        // CURRENT MONTH ALL CONTACT LEEDS
        $currentLeeds = Contact::whereMonth('created_at', Carbon::now()->month)->latest()->get();
---
select * from `seminars` where `date` between '2022-05-21 00:00:00' and '2022-05-27 23:59:59' and `status` = 1 order by `date` asc
select * from `contacts` where month(`created_at`) = '05' order by `created_at` desc