app/Http/Livewire/Role/RoleManage.php

    public function mount()
    {
        $roles = Role::with('permissions')->get();
---
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (2, 3, 4)

    public function render()
    {
        return view('livewire.role.role-manage', ['permissions' => Permission::toBase()->get()]);
---
select * from `permissions`

    public function changeStatus($RoleId)
    {
        $seminar = Role::find($RoleId);
        if ($seminar->status == false) {
            $seminar->status = true;
        } else {
            $seminar->status = false;
        }
        $seminar->save();
---
select * from `roles` where `roles`.`id` = 1 limit 1
update `roles` set `status` = 1, `roles`.`updated_at` = '2022-05-23 16:16:53' where `id` = 1