app/Http/Livewire/Course/CreateCourse.php

    public function render()
    {
        return view('livewire.course.create-course', ['departments' => Department::latest()->where('status', true)->toBase()->get()]);
---
select * from `departments` where `status` = 1 and `departments`.`deleted_at` is null order by `created_at` desc