app/Http/Livewire/Course/CreateCourse.php

select * from `departments` where `departments`.`deleted_at` is null order by `created_at` desc
---
    public function render()
    {
        return view('livewire.course.create-course', ['departments' => Department::latest()->toBase()->get()]);