app/Http/Livewire/Course/Image.php

    public function render()
    {
        return view('livewire.course.image', ['files' => FileManager::latest()->toBase()->get()]);
---
select * from `file_managers` order by `created_at` desc