app/Http/Livewire/Course/MarketPlace.php

    public function render()
    {
        return view('livewire.course.market-place', ['files' => FileManager::latest()->toBase()->get()]);
---
select * from `file_managers` order by `created_at` desc