app/Http/Livewire/Course/Softwares.php

select * from `file_managers` order by `created_at` desc
---
    public function render()
    {
        return view('livewire.course.softwares', ['files' => FileManager::latest()->toBase()->get()]);