app/Providers/FooterServiceProvider.php

    public function boot()
    {
        view()->composer('layouts.frontendapp', function ($view) {
            $view->with('footer', Footer::first())->with('portfolio', Portfolio::first())->with('socialLinks', SocialIcons::where('status', true)->toBase()->get());;
        });
        view()->composer('frontend.index', function ($view) {
            $view->with('footer', Footer::first());
        });


        view()->composer('layouts.blogapp', function ($view) {
            $view->with('footer', Footer::first())->with('portfolio', Portfolio::first())->with('socialLinks', SocialIcons::where('status', true)->toBase()->get());;
        });
---
select * from `footers` limit 1
select * from `portfolios` limit 1
select * from `social_icons`
select * from `social_icons` where `status` = 1