app/Providers/HeaderServiceProvider.php

    public function boot()
    {
        view()->composer('layouts.frontendapp', function ($view) {
            $view->with('header', Header::select('id', 'logo', 'phone', 'email')->first());
        });
        view()->composer('layouts.blogapp', function ($view) {
            $view->with('header', Header::select('id', 'logo', 'phone', 'email')->first())->with('categories', BlogCategory::select('id', 'name', 'status')->toBase()->get());
        });
        view()->composer('layouts.backendapp', function ($view) {
            $view->with('header', HomeCustomize::first());
---
select `id`, `logo`, `phone`, `email` from `headers` limit 1
select `id`, `name`, `status` from `blog_categories`
select * from `home_customizes` limit 1