app/Http/Controllers/backend/CourseController.php

select * from `features` where `features`.`id` = '2' limit 1
---
    public function test(Request $request, $id)
    {

        $request->validate([
            'feature_title' => 'required',
            'feature_detail' => 'required',
        ]);


        $feature = Feature::find($id);